export type SceneType = {
    map: number[][]
    lead: LeadType
}

export type LeadType = {
    position: cc.Vec2
}


export class Scenes {
    // 场景1
    public static scene1: SceneType = {
        // 地图  注意，每一行的元素个数必须相同
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 0, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(2, 6)
        }
        // 后面还还会有敌人宝箱什么的
    }

    // 场景2
    public static scene2: SceneType = {
        // 地图
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 0, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(2, 2)
        }
    }
}