export type SceneType = {
    map: number[][]
    lead: LeadType
}

export type LeadType = {
    position: cc.Vec2
}


export class Scenes {
    // 场景1
    public static scene1: SceneType = {
        // 地图  注意，每一行的元素个数必须相同
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 0, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(2, 6)
        }
        // 后面还还会有敌人宝箱什么的
    }

    // 场景2
    public static scene2: SceneType = {
        // 地图
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 0, 1],
            [1, 1, 1, 1, 1, 1, 1, 0, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(2, 2)
        }
    }

    public static scene3: SceneType = {
        // 地图
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 1],
            [1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1],
            [1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1],
            [1, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1, 1, 1],
            [1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1],
            [1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1],
            [1, 1, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(1, 6)
        }
    }

    public static sceneCs: SceneType = {
        // 地图
        map: [
            // 0表示什么都没有 / 1表示地面 / 2表示墙壁
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 1],
            [1, 1, 1, 1, 2, 2, 1, 1, 2, 1, 1],
            [1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1],
            [1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1],
            [1, 1, 1, 1, 2, 1, 2, 2, 2, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        ],
        // 玩家
        lead: {
            // 玩家的位置
            position: new cc.Vec2(10, 5)
        }
    }

    /** 生成一个随机地图 */
    public static random() {
        let max = new cc.Vec2(12, 12);
        let density = 3
        const lead = { position: new cc.Vec2(Math.round(Math.random() * max.y), Math.round(Math.random() * max.x)) };
        let map: number[][] = [];
        for (let y = 0; y < max.y; y++) {
            map[y] = [];
            for (let x = 0; x < max.x; x++) {
                if(y === lead.position.y && x === lead.position.x) map[y][x] = 1;
                else map[y][x] = Math.floor(Math.random() * 10) < density ? 2 : 1;
            }
        }
        return {
            map,
            lead
        } as SceneType
    }
}